<HTML>
<HEAD>
<TITLE>Laboration Fotoelektrisk Effekt</TITLE>
<link type="text/css" rel="stylesheet" href="../style.css"> 
</HEAD>
<BODY>

<H1>Labb: Fotoelektrisk Effekt (<I>h/e</I>)</H1>

<H2>Introduktion</H2>

<P>Efter att Herz hade skrivit om solljusets effekt p&aring; gnistl&auml;ngder, uppt&auml;ckte &aring;r 
1888 <A 
HREF="http://www.saburchill.com/physics/chapters/0128.html">Hallwachs</A> 
att UV-ljus urladdar negativt laddade zinkplattor. Noggranna m&auml;tningar i 
vakuum visade:</P>
<UL>
    <LI>att ljuset kastade l&auml;tta negativa partiklar (elektroner) ur 
    materialet
    <LI>att elektronernas energi inte berodde p&aring; ljusets intensitet
    <LI>att fotostr&ouml;mmen (antalet elektroner) var proportionell mot 
    ljusintensiteten
    <LI>att det fanns en tr&ouml;skelv&aring;gl&auml;ngd; l&auml;ngre v&aring;gl&auml;ngder orsakade ingen 
    fotostr&ouml;m, hur h&ouml;g intensiteten &auml;n var; olika materialer hade olika 
    tr&ouml;skelv&aring;gl&auml;ngder
    <LI>att de snabbaste elektronernas kinetiska energi &ouml;kade med kortare 
    v&aring;gl&auml;ngder
</UL>    
<P>Om ljuset enligt Maxwell ska beskrivas som en elektromagnetisk v&aring;gr&ouml;relse,
f&ouml;rv&auml;ntar man sig att det elektriska f&auml;ltets 
amplitud p&aring;verkar elektronernas energi. Men s&aring; &auml;r allts&aring; inte fallet. Men 
Einstein l&ouml;ste problemet genom att (i Plancks fotsp&aring;r) anta att ljuset 
avger energi i sm&aring; paket (kvanter) med energi <I>E=hf</I>, d&auml;r 
<I>h</I> &aring;r 
Planks konstant av verkan och d&auml;r <I>f=c/&lambda;</I> &auml;r ljusets 
frekvens. F&ouml;r att en elektron ska l&auml;mna materialet kr&auml;vs det en minimum 
energi, uttr&auml;desarbetet <I>W<sub>f </sub></I>, olika f&ouml;r olika metaller. 
De snabbaste elektronernas kinetiska energi blir d&aring; <I>E<sub>kin</sub> = hf - 
W<sub>f </sub></I>. </P>

<P><CENTER><IMG SRC="fotoelek.gif"><BR>
<B>Obligatorisk f&ouml;rberedelseuppgift</B>: Hur stor &auml;r det h&auml;r &auml;mnets <I>W<sub>f </sub></I>?</CENTER></P>

<H2>Apparatur</H2>

<H4>Fotocellen</H4>

<P>Hur m&auml;ter man nu elektronernas kinetiska energi? Det skulle vara m&ouml;jligt 
att m&auml;ta elektronernas hastighet, men det &auml;r mycket enklare att best&auml;mma 
den s&aring; kallade stoppsp&auml;nningen. Om anoden &auml;r mer positiv &auml;n 
fotokatoden &auml;r fotostr&ouml;mmen oberoende av sp&auml;nningen, eftersom alla fria 
elektroner dras dit. Men om anoden &auml;r negativ, bromsas elektronerna upp. 
L&aring;ngsamma elektroner har d&aring; inte tillr&auml;cklig kinetisk energi f&ouml;r att n&aring; 
anoden, och fotostr&ouml;mmen minskar.</P>

<P><CENTER><IMG SRC="fotoelrep.gif"></CENTER></P>

<P>Om sp&auml;nningen mellan katod och anod &auml;r <I>V</I>, &auml;r f&ouml;r en partikel med 
laddning <I>q</I> skillnaden i potentiell energi lika med <I>qV</I>. En 
elektron har laddning <I>-e</I> = 1,60.10<sup>-19</sup> C. Genom att m&auml;ta 
stoppsp&auml;nningen, har man d&aring; best&auml;md de snabbaste elektronernas kinetiska 
energi i enheten eV (elektronVolt). Om man m&auml;ter stoppsp&auml;nningen f&ouml;r n&aring;gra 
olika v&aring;gl&auml;ngder, kan man ur en graf av stoppsp&auml;nning mot ljusets frekvens 
best&auml;mma <A HREF="http://physics.nist.gov/cgi-bin/cuu/Value?hev">
Plancks konstant i enheter eV&middot;s</A>. Det &auml;r allts&aring; <I>h/e</I>.</P>


<TABLE>
    <TR><TD><IMG SRC="Planck_cell.jpg"></TD>
    <TD>Med v&aring;r fotocell (Pasco) kan vi inte m&auml;ta fotostr&ouml;mmen. Ist&auml;llet laddar 
fotocellen upp en kapacitans. N&auml;r str&ouml;mmen blir noll, &auml;r sp&auml;nningen &ouml;ver 
kapacitansen lika med stoppsp&auml;nningen. En OP-f&ouml;rst&auml;rkare ansluten som 
f&ouml;ljare buffrar sp&auml;nningen s&aring; att den kan m&auml;tas utan att urladda 
kapacitansen. Det betyder ocks&aring; att sp&auml;nningen avtar mycket l&aring;ngsamt n&auml;r 
man st&auml;ngar av ljuset eller anv&auml;nder en l&auml;ngre v&aring;gl&auml;ngd. D&auml;rf&ouml;r finns det 
en Reset-knapp s&aring; att kapacitansen kan urladdas.</TD>
</TR>
</TABLE> 

<H4>Ljusk&auml;llan</H4>

<TABLE>
    <TR>
	<TD><IMG SRC="Planck_lampa.jpg"></TD>
        <TD><P>Vi anv&auml;nder en kviksilverlampa. De viktigaste linjerna i ett 
<A HREF="http://commons.wikimedia.org/wiki/File:Compact-Disc-spectrum-Mercury.jpg">
Hg-spektrum</A> har v&aring;gl&auml;ngder 578 nm (tv&aring; gula linjer), 546,1 nm (gr&ouml;n), 435,8 nm (bl&aring;) 404,7 nm 
(violet) och 365,5 nm (ultraviolet). Linjerna skiljs av ett 
diffraktionsgitter och fokusseras p&aring; en spalt i en sk&auml;rm. Eftersom sk&auml;rmen 
inneh&aring;ller ett fluorescerande &auml;mne, kan man &auml;ven l&auml;tt st&auml;lla in fotocellen 
p&aring; denna annars osynliga linje.</P>
<P><B>Obligatorisk f&ouml;rberedelseuppgift</B>: r&auml;kna ut de olika Hg-linjernas frekvens i hertz.</P>
</TD>
</TR>
</TABLE>


<H2>Genomf&ouml;rande</H2>

<P>Det finns tv&aring; experiment. Instruktioner delas ut p&aring; laborationen. De kommer 
ur Pasco's handledning.
<UL>
    <LI>M&auml;t stoppsp&auml;nning som funktion av ljusets frekvens.
    <LI>M&auml;t stoppsp&auml;nning som funktion av ljusets intensitet.
</UL>    
</P>

<h4>Bearbetning</h4>
<UL>
    <LI>Anv&auml;nd t ex Logger Pro eller <a href="https://plot.ly/how-to-create-a-line-of-best-fits/">plot.ly</a> f&ouml;r att plotta stoppsp&auml;nning som funktion av ljusets frekvens.
    <LI>Best&auml;m regressionskoefficienterna. (I Logger Pro ska man dubbelklicka fitresultaten f&ouml;r att f&aring; fram standardavvikelser.)
    <LI>Best&auml;m Plancks konstant i [eV&middot;s] och i [J&middot;s] och j&auml;mf&ouml;r med <A HREF="http://physics.nist.gov/cgi-bin/cuu/Value?hev">
    litteraturv&auml;rden</A>. Diskutera felk&auml;llor.
    <LI>Vad &auml;r betydelsen av regressionskoefficienten <I>b</I> i sambandet <I>y=mx+b</I>?
    <LI>(Vilket material kan det handla om i vakuumr&ouml;ret?)
    <LI>Hur stor &auml;r tr&ouml;skelv&aring;gl&auml;ngden?
</UL>


<H4>N&aring;gra java-applets om fotoelektrisk effekt:</H4>

<UL>
    <LI><A HREF="http://phet.colorado.edu/en/simulation/photoelectric">
    PhET Simulations</A>, <A HREF="http://phet.colorado.edu/sims/photoelectric/photoelectric_sv.jnlp">applet p&aring; svenska</A> (men str&ouml;mmens beroende p&aring; v&aring;gl&auml;ngd &auml;r inte 
    s&aring; enkelt)
    <LI><A HREF="http://web.hep.uiuc.edu/home/tstelzer/102project/pe.htm">
    Ett mycket vackert ShockWave-program</A> (men sp&auml;nningerna &auml;r en 
    tiopotens fel, och &auml;ven h&auml;r ett f&ouml;r enkelt 
    beroende av fotostr&ouml;m p&aring; fotonenergi)
</UL>


<H4>Referenser</H4>
<UL>
    <LI><A HREF="http://nobelprize.org/educational_games/physics/quantised_world/waves-particles-1.html">
    Nobelmuseet</A>
    <LI><A HREF="http://galileo.phys.virginia.edu/classes/252/photoelectric_effect.html">
    Historisk bakgrund</A>
    <LI><A HREF="http://hyperphysics.phy-astr.gsu.edu/hbase/mod2.html">
    Millikans m&auml;tresultat (1916)</A>
    <LI><A HREF="http://www.hamamatsu.com/jp/en/support/glossary/p/index.html">Olika material f&ouml;r fotokatoder</A> (Hamamatsu)
</UL>    

</BODY>
</HTML>